[
    {
        "title": "UniVerse-1: Unified Audio-Video Generation via Stitching of Experts",
        "summary": "We introduce UniVerse-1, a unified, Veo-3-like model capable of\nsimultaneously generating coordinated audio and video. To enhance training\nefficiency, we bypass training from scratch and instead employ a stitching of\nexperts (SoE) technique. This approach deeply fuses the corresponding blocks of\npre-trained video and music generation experts models, thereby fully leveraging\ntheir foundational capabilities. To ensure accurate annotations and temporal\nalignment for both ambient sounds and speech with video content, we developed\nan online annotation pipeline that processes the required training data and\ngenerates labels during training process. This strategy circumvents the\nperformance degradation often caused by misalignment text-based annotations.\nThrough the synergy of these techniques, our model, after being finetuned on\napproximately 7,600 hours of audio-video data, produces results with\nwell-coordinated audio-visuals for ambient sounds generation and strong\nalignment for speech generation. To systematically evaluate our proposed\nmethod, we introduce Verse-Bench, a new benchmark dataset. In an effort to\nadvance research in audio-video generation and to close the performance gap\nwith state-of-the-art models such as Veo3, we make our model and code publicly\navailable. We hope this contribution will benefit the broader research\ncommunity. Project page: https://dorniwang.github.io/UniVerse-1/.",
        "url": "http://arxiv.org/abs/2509.06155v1",
        "published_date": "2025-09-07T17:55:03+00:00",
        "updated_date": "2025-09-07T17:55:03+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Duomin Wang",
            "Wei Zuo",
            "Aojie Li",
            "Ling-Hao Chen",
            "Xinyao Liao",
            "Deyu Zhou",
            "Zixin Yin",
            "Xili Dai",
            "Daxin Jiang",
            "Gang Yu"
        ],
        "tldr": "UniVerse-1 is introduced, a unified audio-video generation model employing a stitching of experts technique and an online annotation pipeline for improved training efficiency and audio-visual alignment, evaluated with a new benchmark dataset.",
        "tldr_zh": "UniVerse-1被提出，它是一个统一的音频视频生成模型，采用了专家缝合技术和一个在线标注流程，以提高训练效率和音频视频对齐，并使用一个新的基准数据集进行评估。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]