[
    {
        "title": "QuaDreamer: Controllable Panoramic Video Generation for Quadruped Robots",
        "summary": "Panoramic cameras, capturing comprehensive 360-degree environmental data, are\nsuitable for quadruped robots in surrounding perception and interaction with\ncomplex environments. However, the scarcity of high-quality panoramic training\ndata-caused by inherent kinematic constraints and complex sensor calibration\nchallenges-fundamentally limits the development of robust perception systems\ntailored to these embodied platforms. To address this issue, we propose\nQuaDreamer-the first panoramic data generation engine specifically designed for\nquadruped robots. QuaDreamer focuses on mimicking the motion paradigm of\nquadruped robots to generate highly controllable, realistic panoramic videos,\nproviding a data source for downstream tasks. Specifically, to effectively\ncapture the unique vertical vibration characteristics exhibited during\nquadruped locomotion, we introduce Vertical Jitter Encoding (VJE). VJE extracts\ncontrollable vertical signals through frequency-domain feature filtering and\nprovides high-quality prompts. To facilitate high-quality panoramic video\ngeneration under jitter signal control, we propose a Scene-Object Controller\n(SOC) that effectively manages object motion and boosts background jitter\ncontrol through the attention mechanism. To address panoramic distortions in\nwide-FoV video generation, we propose the Panoramic Enhancer (PE)-a dual-stream\narchitecture that synergizes frequency-texture refinement for local detail\nenhancement with spatial-structure correction for global geometric consistency.\nWe further demonstrate that the generated video sequences can serve as training\ndata for the quadruped robot's panoramic visual perception model, enhancing the\nperformance of multi-object tracking in 360-degree scenes. The source code and\nmodel weights will be publicly available at\nhttps://github.com/losehu/QuaDreamer.",
        "url": "http://arxiv.org/abs/2508.02512v1",
        "published_date": "2025-08-04T15:18:01+00:00",
        "updated_date": "2025-08-04T15:18:01+00:00",
        "categories": [
            "cs.RO",
            "cs.CV",
            "eess.IV"
        ],
        "authors": [
            "Sheng Wu",
            "Fei Teng",
            "Hao Shi",
            "Qi Jiang",
            "Kai Luo",
            "Kaiwei Wang",
            "Kailun Yang"
        ],
        "tldr": "QuaDreamer is a panoramic video generation engine designed for quadruped robots, addressing the scarcity of training data by generating controllable, realistic videos using techniques like Vertical Jitter Encoding, Scene-Object Controller, and Panoramic Enhancer.",
        "tldr_zh": "QuaDreamer是一个专为四足机器人设计的全景视频生成引擎，通过垂直抖动编码、场景-对象控制器和全景增强器等技术生成可控的、逼真的视频，从而解决训练数据稀缺的问题。",
        "relevance_score": 8,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    }
]