[
    {
        "title": "HiStream: Efficient High-Resolution Video Generation via Redundancy-Eliminated Streaming",
        "summary": "High-resolution video generation, while crucial for digital media and film, is computationally bottlenecked by the quadratic complexity of diffusion models, making practical inference infeasible. To address this, we introduce HiStream, an efficient autoregressive framework that systematically reduces redundancy across three axes: i) Spatial Compression: denoising at low resolution before refining at high resolution with cached features; ii) Temporal Compression: a chunk-by-chunk strategy with a fixed-size anchor cache, ensuring stable inference speed; and iii) Timestep Compression: applying fewer denoising steps to subsequent, cache-conditioned chunks. On 1080p benchmarks, our primary HiStream model (i+ii) achieves state-of-the-art visual quality while demonstrating up to 76.2x faster denoising compared to the Wan2.1 baseline and negligible quality loss. Our faster variant, HiStream+, applies all three optimizations (i+ii+iii), achieving a 107.5x acceleration over the baseline, offering a compelling trade-off between speed and quality, thereby making high-resolution video generation both practical and scalable.",
        "url": "http://arxiv.org/abs/2512.21338v1",
        "published_date": "2025-12-24T18:59:58+00:00",
        "updated_date": "2025-12-24T18:59:58+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Haonan Qiu",
            "Shikun Liu",
            "Zijian Zhou",
            "Zhaochong An",
            "Weiming Ren",
            "Zhiheng Liu",
            "Jonas Schult",
            "Sen He",
            "Shoufa Chen",
            "Yuren Cong",
            "Tao Xiang",
            "Ziwei Liu",
            "Juan-Manuel Perez-Rua"
        ],
        "tldr": "HiStream introduces a novel autoregressive framework for efficient high-resolution video generation by systematically reducing redundancy in spatial, temporal, and timestep dimensions, achieving significant speedups compared to baseline methods.",
        "tldr_zh": "HiStream 提出了一种新颖的自回归框架，通过在空间、时间和时间步长维度上系统地减少冗余，从而实现高效的高分辨率视频生成，与基线方法相比，实现了显着的加速。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]