[
    {
        "title": "World Models That Know When They Don't Know: Controllable Video Generation with Calibrated Uncertainty",
        "summary": "Recent advances in generative video models have led to significant breakthroughs in high-fidelity video synthesis, specifically in controllable video generation where the generated video is conditioned on text and action inputs, e.g., in instruction-guided video editing and world modeling in robotics. Despite these exceptional capabilities, controllable video models often hallucinate - generating future video frames that are misaligned with physical reality - which raises serious concerns in many tasks such as robot policy evaluation and planning. However, state-of-the-art video models lack the ability to assess and express their confidence, impeding hallucination mitigation. To rigorously address this challenge, we propose C3, an uncertainty quantification (UQ) method for training continuous-scale calibrated controllable video models for dense confidence estimation at the subpatch level, precisely localizing the uncertainty in each generated video frame. Our UQ method introduces three core innovations to empower video models to estimate their uncertainty. First, our method develops a novel framework that trains video models for correctness and calibration via strictly proper scoring rules. Second, we estimate the video model's uncertainty in latent space, avoiding training instability and prohibitive training costs associated with pixel-space approaches. Third, we map the dense latent-space uncertainty to interpretable pixel-level uncertainty in the RGB space for intuitive visualization, providing high-resolution uncertainty heatmaps that identify untrustworthy regions. Through extensive experiments on large-scale robot learning datasets (Bridge and DROID) and real-world evaluations, we demonstrate that our method not only provides calibrated uncertainty estimates within the training distribution, but also enables effective out-of-distribution detection.",
        "url": "http://arxiv.org/abs/2512.05927v1",
        "published_date": "2025-12-05T18:06:18+00:00",
        "updated_date": "2025-12-05T18:06:18+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.RO"
        ],
        "authors": [
            "Zhiting Mei",
            "Tenny Yin",
            "Micah Baker",
            "Ola Shorinwa",
            "Anirudha Majumdar"
        ],
        "tldr": "This paper introduces a method (C3) for quantifying and calibrating uncertainty in controllable video generation models, enabling them to express confidence and identify potentially hallucinated regions within generated video frames.",
        "tldr_zh": "本文介绍了一种名为C3的方法，用于量化和校准可控视频生成模型中的不确定性，使其能够表达置信度并识别生成视频帧中可能出现的幻觉区域。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    }
]