[
    {
        "title": "Diff4Splat: Controllable 4D Scene Generation with Latent Dynamic Reconstruction Models",
        "summary": "We introduce Diff4Splat, a feed-forward method that synthesizes controllable\nand explicit 4D scenes from a single image. Our approach unifies the generative\npriors of video diffusion models with geometry and motion constraints learned\nfrom large-scale 4D datasets. Given a single input image, a camera trajectory,\nand an optional text prompt, Diff4Splat directly predicts a deformable 3D\nGaussian field that encodes appearance, geometry, and motion, all in a single\nforward pass, without test-time optimization or post-hoc refinement. At the\ncore of our framework lies a video latent transformer, which augments video\ndiffusion models to jointly capture spatio-temporal dependencies and predict\ntime-varying 3D Gaussian primitives. Training is guided by objectives on\nappearance fidelity, geometric accuracy, and motion consistency, enabling\nDiff4Splat to synthesize high-quality 4D scenes in 30 seconds. We demonstrate\nthe effectiveness of Diff4Splatacross video generation, novel view synthesis,\nand geometry extraction, where it matches or surpasses optimization-based\nmethods for dynamic scene synthesis while being significantly more efficient.",
        "url": "http://arxiv.org/abs/2511.00503v1",
        "published_date": "2025-11-01T11:16:25+00:00",
        "updated_date": "2025-11-01T11:16:25+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Panwang Pan",
            "Chenguo Lin",
            "Jingjing Zhao",
            "Chenxin Li",
            "Yuchen Lin",
            "Haopeng Li",
            "Honglei Yan",
            "Kairun Wen",
            "Yunlong Lin",
            "Yixuan Yuan",
            "Yadong Mu"
        ],
        "tldr": "Diff4Splat is a feed-forward method for generating controllable 4D scenes from a single image using a video latent transformer and 3D Gaussian primitives, achieving high quality and efficiency.",
        "tldr_zh": "Diff4Splat是一种前馈方法，它使用视频潜在变换器和3D高斯原语，从单个图像生成可控的4D场景，实现了高质量和高效率。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]