[
    {
        "title": "AlcheMinT: Fine-grained Temporal Control for Multi-Reference Consistent Video Generation",
        "summary": "Recent advances in subject-driven video generation with large diffusion models have enabled personalized content synthesis conditioned on user-provided subjects. However, existing methods lack fine-grained temporal control over subject appearance and disappearance, which are essential for applications such as compositional video synthesis, storyboarding, and controllable animation. We propose AlcheMinT, a unified framework that introduces explicit timestamps conditioning for subject-driven video generation. Our approach introduces a novel positional encoding mechanism that unlocks the encoding of temporal intervals, associated in our case with subject identities, while seamlessly integrating with the pretrained video generation model positional embeddings. Additionally, we incorporate subject-descriptive text tokens to strengthen binding between visual identity and video captions, mitigating ambiguity during generation. Through token-wise concatenation, AlcheMinT avoids any additional cross-attention modules and incurs negligible parameter overhead. We establish a benchmark evaluating multiple subject identity preservation, video fidelity, and temporal adherence. Experimental results demonstrate that AlcheMinT achieves visual quality matching state-of-the-art video personalization methods, while, for the first time, enabling precise temporal control over multi-subject generation within videos. Project page is at https://snap-research.github.io/Video-AlcheMinT",
        "url": "http://arxiv.org/abs/2512.10943v1",
        "published_date": "2025-12-11T18:59:34+00:00",
        "updated_date": "2025-12-11T18:59:34+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Sharath Girish",
            "Viacheslav Ivanov",
            "Tsai-Shien Chen",
            "Hao Chen",
            "Aliaksandr Siarohin",
            "Sergey Tulyakov"
        ],
        "tldr": "AlcheMinT introduces fine-grained temporal control for subject appearance and disappearance in personalized video generation by using explicit timestamp conditioning and subject-descriptive text tokens, achieving state-of-the-art visual quality with temporal control.",
        "tldr_zh": "AlcheMinT通过使用显式时间戳调节和主体描述性文本标记，为个性化视频生成引入了对主体出现和消失的细粒度时间控制，在实现最先进的视觉质量的同时，实现了时间控制。",
        "relevance_score": 8,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]