[
    {
        "title": "Kandinsky 5.0: A Family of Foundation Models for Image and Video Generation",
        "summary": "This report introduces Kandinsky 5.0, a family of state-of-the-art foundation models for high-resolution image and 10-second video synthesis. The framework comprises three core line-up of models: Kandinsky 5.0 Image Lite - a line-up of 6B parameter image generation models, Kandinsky 5.0 Video Lite - a fast and lightweight 2B parameter text-to-video and image-to-video models, and Kandinsky 5.0 Video Pro - 19B parameter models that achieves superior video generation quality. We provide a comprehensive review of the data curation lifecycle - including collection, processing, filtering and clustering - for the multi-stage training pipeline that involves extensive pre-training and incorporates quality-enhancement techniques such as self-supervised fine-tuning (SFT) and reinforcement learning (RL)-based post-training. We also present novel architectural, training, and inference optimizations that enable Kandinsky 5.0 to achieve high generation speeds and state-of-the-art performance across various tasks, as demonstrated by human evaluation. As a large-scale, publicly available generative framework, Kandinsky 5.0 leverages the full potential of its pre-training and subsequent stages to be adapted for a wide range of generative applications. We hope that this report, together with the release of our open-source code and training checkpoints, will substantially advance the development and accessibility of high-quality generative models for the research community.",
        "url": "http://arxiv.org/abs/2511.14993v1",
        "published_date": "2025-11-19T00:23:22+00:00",
        "updated_date": "2025-11-19T00:23:22+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.LG"
        ],
        "authors": [
            "Vladimir Arkhipkin",
            "Vladimir Korviakov",
            "Nikolai Gerasimenko",
            "Denis Parkhomenko",
            "Viacheslav Vasilev",
            "Alexey Letunovskiy",
            "Maria Kovaleva",
            "Nikolai Vaulin",
            "Ivan Kirillov",
            "Lev Novitskiy",
            "Denis Koposov",
            "Nikita Kiselev",
            "Alexander Varlamov",
            "Dmitrii Mikhailov",
            "Vladimir Polovnikov",
            "Andrey Shutkin",
            "Ilya Vasiliev",
            "Julia Agafonova",
            "Anastasiia Kargapoltseva",
            "Anna Dmitrienko",
            "Anastasia Maltseva",
            "Anna Averchenkova",
            "Olga Kim",
            "Tatiana Nikulina",
            "Denis Dimitrov"
        ],
        "tldr": "Kandinsky 5.0 introduces a family of foundation models for high-resolution image and video generation, featuring different model sizes and optimization techniques, with open-source code and checkpoints released to foster research and accessibility.",
        "tldr_zh": "Kandinsky 5.0 推出了一系列用于高分辨率图像和视频生成的基础模型，具有不同的模型大小和优化技术，并发布了开源代码和检查点，以促进研究和可访问性。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]