[
    {
        "title": "Compute Only 16 Tokens in One Timestep: Accelerating Diffusion Transformers with Cluster-Driven Feature Caching",
        "summary": "Diffusion transformers have gained significant attention in recent years for\ntheir ability to generate high-quality images and videos, yet still suffer from\na huge computational cost due to their iterative denoising process. Recently,\nfeature caching has been introduced to accelerate diffusion transformers by\ncaching the feature computation in previous timesteps and reusing it in the\nfollowing timesteps, which leverage the temporal similarity of diffusion models\nwhile ignoring the similarity in the spatial dimension. In this paper, we\nintroduce Cluster-Driven Feature Caching (ClusCa) as an orthogonal and\ncomplementary perspective for previous feature caching. Specifically, ClusCa\nperforms spatial clustering on tokens in each timestep, computes only one token\nin each cluster and propagates their information to all the other tokens, which\nis able to reduce the number of tokens by over 90%. Extensive experiments on\nDiT, FLUX and HunyuanVideo demonstrate its effectiveness in both text-to-image\nand text-to-video generation. Besides, it can be directly applied to any\ndiffusion transformer without requirements for training. For instance, ClusCa\nachieves 4.96x acceleration on FLUX with an ImageReward of 99.49%, surpassing\nthe original model by 0.51%. The code is available at\nhttps://github.com/Shenyi-Z/Cache4Diffusion.",
        "url": "http://arxiv.org/abs/2509.10312v1",
        "published_date": "2025-09-12T14:53:45+00:00",
        "updated_date": "2025-09-12T14:53:45+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Zhixin Zheng",
            "Xinyu Wang",
            "Chang Zou",
            "Shaobo Wang",
            "Linfeng Zhang"
        ],
        "tldr": "This paper introduces Cluster-Driven Feature Caching (ClusCa), a method to accelerate diffusion transformers by spatially clustering tokens and only computing a representative token in each cluster, achieving significant speedups in image and video generation without retraining.",
        "tldr_zh": "本文介绍了聚类驱动特征缓存（ClusCa），这是一种通过对 tokens 进行空间聚类，并仅计算每个聚类中的代表性 token 来加速扩散 Transformer 的方法，从而在图像和视频生成中实现显著加速，且无需重新训练。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]