[
    {
        "title": "Versatile Transition Generation with Image-to-Video Diffusion",
        "summary": "Leveraging text, images, structure maps, or motion trajectories as\nconditional guidance, diffusion models have achieved great success in automated\nand high-quality video generation. However, generating smooth and rational\ntransition videos given the first and last video frames as well as descriptive\ntext prompts is far underexplored. We present VTG, a Versatile Transition video\nGeneration framework that can generate smooth, high-fidelity, and semantically\ncoherent video transitions. VTG introduces interpolation-based initialization\nthat helps preserve object identity and handle abrupt content changes\neffectively. In addition, it incorporates dual-directional motion fine-tuning\nand representation alignment regularization to mitigate the limitations of\npre-trained image-to-video diffusion models in motion smoothness and generation\nfidelity, respectively. To evaluate VTG and facilitate future studies on\nunified transition generation, we collected TransitBench, a comprehensive\nbenchmark for transition generation covering two representative transition\ntasks: concept blending and scene transition. Extensive experiments show that\nVTG achieves superior transition performance consistently across all four\ntasks.",
        "url": "http://arxiv.org/abs/2508.01698v1",
        "published_date": "2025-08-03T10:03:56+00:00",
        "updated_date": "2025-08-03T10:03:56+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Zuhao Yang",
            "Jiahui Zhang",
            "Yingchen Yu",
            "Shijian Lu",
            "Song Bai"
        ],
        "tldr": "The paper introduces VTG, a framework for generating smooth and coherent video transitions using diffusion models, and presents TransitBench, a new benchmark for evaluating transition generation tasks.",
        "tldr_zh": "该论文介绍了VTG，一个使用扩散模型生成平滑和连贯视频过渡的框架，并提出了TransitBench，一个新的用于评估过渡生成任务的基准。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]