[
    {
        "title": "Pixel-to-4D: Camera-Controlled Image-to-Video Generation with Dynamic 3D Gaussians",
        "summary": "Humans excel at forecasting the future dynamics of a scene given just a single image. Video generation models that can mimic this ability are an essential component for intelligent systems. Recent approaches have improved temporal coherence and 3D consistency in single-image-conditioned video generation. However, these methods often lack robust user controllability, such as modifying the camera path, limiting their applicability in real-world applications. Most existing camera-controlled image-to-video models struggle with accurately modeling camera motion, maintaining temporal consistency, and preserving geometric integrity. Leveraging explicit intermediate 3D representations offers a promising solution by enabling coherent video generation aligned with a given camera trajectory. Although these methods often use 3D point clouds to render scenes and introduce object motion in a later stage, this two-step process still falls short in achieving full temporal consistency, despite allowing precise control over camera movement. We propose a novel framework that constructs a 3D Gaussian scene representation and samples plausible object motion, given a single image in a single forward pass. This enables fast, camera-guided video generation without the need for iterative denoising to inject object motion into render frames. Extensive experiments on the KITTI, Waymo, RealEstate10K and DL3DV-10K datasets demonstrate that our method achieves state-of-the-art video quality and inference efficiency. The project page is available at https://melonienimasha.github.io/Pixel-to-4D-Website.",
        "url": "http://arxiv.org/abs/2601.00678v1",
        "published_date": "2026-01-02T13:04:47+00:00",
        "updated_date": "2026-01-02T13:04:47+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Melonie de Almeida",
            "Daniela Ivanova",
            "Tong Shi",
            "John H. Williamson",
            "Paul Henderson"
        ],
        "tldr": "This paper introduces a novel camera-controlled image-to-video generation framework, called Pixel-to-4D, using dynamic 3D Gaussians for improved temporal consistency and user control, achieving state-of-the-art results on various datasets.",
        "tldr_zh": "该论文提出了一种新颖的相机控制图像到视频生成框架，名为Pixel-to-4D，它使用动态3D高斯函数以提高时间一致性和用户控制，并在各种数据集上取得了最先进的结果。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]