[
    {
        "title": "VINO: A Unified Visual Generator with Interleaved OmniModal Context",
        "summary": "We present VINO, a unified visual generator that performs image and video generation and editing within a single framework. Instead of relying on task-specific models or independent modules for each modality, VINO uses a shared diffusion backbone that conditions on text, images and videos, enabling a broad range of visual creation and editing tasks under one model. Specifically, VINO couples a vision-language model (VLM) with a Multimodal Diffusion Transformer (MMDiT), where multimodal inputs are encoded as interleaved conditioning tokens, and then used to guide the diffusion process. This design supports multi-reference grounding, long-form instruction following, and coherent identity preservation across static and dynamic content, while avoiding modality-specific architectural components. To train such a unified system, we introduce a multi-stage training pipeline that progressively expands a video generation base model into a unified, multi-task generator capable of both image and video input and output. Across diverse generation and editing benchmarks, VINO demonstrates strong visual quality, faithful instruction following, improved reference and attribute preservation, and more controllable multi-identity edits. Our results highlight a practical path toward scalable unified visual generation, and the promise of interleaved, in-context computation as a foundation for general-purpose visual creation.",
        "url": "http://arxiv.org/abs/2601.02358v1",
        "published_date": "2026-01-05T18:56:34+00:00",
        "updated_date": "2026-01-05T18:56:34+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Junyi Chen",
            "Tong He",
            "Zhoujie Fu",
            "Pengfei Wan",
            "Kun Gai",
            "Weicai Ye"
        ],
        "tldr": "VINO is a unified visual generator using a shared diffusion backbone conditioned on text, images, and videos for various generation and editing tasks, showcasing strong performance across benchmarks.",
        "tldr_zh": "VINO是一个统一的视觉生成器，它使用共享的扩散骨干网络，以文本、图像和视频为条件，用于各种生成和编辑任务，并在各项基准测试中表现出色。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    }
]